app/Http/Controllers/HomeController.php

    public function index()
    {
        if(Auth::user()->role_id == 5) {
            $customer = Customer::select('id')->where('user_id', Auth::id())->first();
            $lims_sale_data = Sale::with('warehouse')->where('customer_id', $customer->id)->orderBy('created_at', 'desc')->get();
            $lims_payment_data = DB::table('payments')
                           ->join('sales', 'payments.sale_id', '=', 'sales.id')
                           ->where('customer_id', $customer->id)
                           ->select('payments.*', 'sales.reference_no as sale_reference')
                           ->orderBy('payments.created_at', 'desc')
                           ->get();
            $lims_quotation_data = Quotation::with('biller', 'customer', 'supplier', 'user')->orderBy('id', 'desc')->where('customer_id', $customer->id)->orderBy('created_at', 'desc')->get();

            $lims_return_data = Returns::with('warehouse', 'customer', 'biller')->where('customer_id', $customer->id)->orderBy('created_at', 'desc')->get();
            return view('customer_index', compact('lims_sale_data', 'lims_payment_data', 'lims_quotation_data', 'lims_return_data'));
        }

        $start_date = date("Y").'-'.date("m").'-'.'01';
        $end_date = date("Y").'-'.date("m").'-'.date('t', mktime(0, 0, 0, date("m"), 1, date("Y")));
        $yearly_sale_amount = [];

        $general_setting = DB::table('general_settings')->latest()->first();
---
select * from `general_settings` order by `created_at` desc limit 1

            $recent_payment = Payment::orderBy('id', 'desc')->where('user_id', Auth::id())->take(5)->get();
        }
        else {
            $revenue = Sale::whereDate('created_at', '>=' , $start_date)->whereDate('created_at', '<=' , $end_date)->sum('grand_total');
            $return = Returns::whereDate('created_at', '>=' , $start_date)->whereDate('created_at', '<=' , $end_date)->sum('grand_total');
            $purchase_return = ReturnPurchase::whereDate('created_at', '>=' , $start_date)->whereDate('created_at', '<=' , $end_date)->sum('grand_total');
            $revenue = $revenue - $return;
            $lims_employee_list = Employee::where('is_active', true)->get();
            $purchase = Purchase::whereDate('created_at', '>=' , $start_date)->whereDate('created_at', '<=' , $end_date)->sum('grand_total');
            $profit = $revenue + $purchase_return - $purchase;
            $expense = Expense::whereDate('created_at', '>=' , $start_date)->whereDate('created_at', '<=' , $end_date)->sum('amount');
            $recent_sale = Sale::orderBy('id', 'desc')->take(5)->get();
            $recent_purchase = Purchase::orderBy('id', 'desc')->take(5)->get();
            $recent_quotation = Quotation::orderBy('id', 'desc')->take(5)->get();
            $recent_payment = Payment::orderBy('id', 'desc')->take(5)->get();
        }

        $best_selling_qty = Product_Sale::select(DB::raw('product_id, sum(qty) as sold_qty'))->whereDate('created_at', '>=' , $start_date)->whereDate('created_at', '<=' , $end_date)->groupBy('product_id')->orderBy('sold_qty', 'desc')->take(5)->get();

        $yearly_best_selling_qty = Product_Sale::select(DB::raw('product_id, sum(qty) as sold_qty'))->whereDate('created_at', '>=' , date("Y").'-01-01')->whereDate('created_at', '<=' , date("Y").'-12-31')->groupBy('product_id')->orderBy('sold_qty', 'desc')->take(5)->get();

        $yearly_best_selling_price = Product_Sale::select(DB::raw('product_id, sum(total) as total_price'))->whereDate('created_at', '>=' , date("Y").'-01-01')->whereDate('created_at', '<=' , date("Y").'-12-31')->groupBy('product_id')->orderBy('total_price', 'desc')->take(5)->get();
---
select sum(`grand_total`) as aggregate from `sales` where date(`created_at`) >= '2021-05-01' and date(`created_at`) <= '2021-05-31'
select sum(`grand_total`) as aggregate from `returns` where date(`created_at`) >= '2021-05-01' and date(`created_at`) <= '2021-05-31'
select sum(`grand_total`) as aggregate from `return_purchases` where date(`created_at`) >= '2021-05-01' and date(`created_at`) <= '2021-05-31'
select * from `employees` where `is_active` = 1
select sum(`grand_total`) as aggregate from `purchases` where date(`created_at`) >= '2021-05-01' and date(`created_at`) <= '2021-05-31'
select sum(`amount`) as aggregate from `expenses` where date(`created_at`) >= '2021-05-01' and date(`created_at`) <= '2021-05-31'
select * from `sales` order by `id` desc limit 5
select * from `purchases` order by `id` desc limit 5
select * from `quotations` order by `id` desc limit 5
select * from `payments` order by `id` desc limit 5
select product_id, sum(qty) as sold_qty from `product_sales` where date(`created_at`) >= '2021-05-01' and date(`created_at`) <= '2021-05-31' group by `product_id` order by `sold_qty` desc limit 5
select product_id, sum(qty) as sold_qty from `product_sales` where date(`created_at`) >= '2021-01-01' and date(`created_at`) <= '2021-12-31' group by `product_id` order by `sold_qty` desc limit 5
select product_id, sum(total) as total_price from `product_sales` where date(`created_at`) >= '2021-01-01' and date(`created_at`) <= '2021-12-31' group by `product_id` order by `total_price` desc limit 5

                $payroll_amount = Payroll::whereDate('created_at', '>=' , $start_date)->whereDate('created_at', '<=' , $end_date)->where('user_id', Auth::id())->sum('amount');
            }
            else {
                $recieved_amount = DB::table('payments')->whereNotNull('sale_id')->whereDate('created_at', '>=' , $start_date)->whereDate('created_at', '<=' , $end_date)->sum('amount');
                $sent_amount = DB::table('payments')->whereNotNull('purchase_id')->whereDate('created_at', '>=' , $start_date)->whereDate('created_at', '<=' , $end_date)->sum('amount');
                $return_amount = Returns::whereDate('created_at', '>=' , $start_date)->whereDate('created_at', '<=' , $end_date)->sum('grand_total');
                $purchase_return_amount = ReturnPurchase::whereDate('created_at', '>=' , $start_date)->whereDate('created_at', '<=' , $end_date)->sum('grand_total');
                $expense_amount = Expense::whereDate('created_at', '>=' , $start_date)->whereDate('created_at', '<=' , $end_date)->sum('amount');
                $payroll_amount = Payroll::whereDate('created_at', '>=' , $start_date)->whereDate('created_at', '<=' , $end_date)->sum('amount');
---
select sum(`amount`) as aggregate from `payments` where `sale_id` is not null and date(`created_at`) >= '2020-12-01' and date(`created_at`) <= '2020-12-31'
select sum(`amount`) as aggregate from `payments` where `purchase_id` is not null and date(`created_at`) >= '2020-12-01' and date(`created_at`) <= '2020-12-31'
select sum(`grand_total`) as aggregate from `returns` where date(`created_at`) >= '2020-12-01' and date(`created_at`) <= '2020-12-31'
select sum(`grand_total`) as aggregate from `return_purchases` where date(`created_at`) >= '2020-12-01' and date(`created_at`) <= '2020-12-31'
select sum(`amount`) as aggregate from `expenses` where date(`created_at`) >= '2020-12-01' and date(`created_at`) <= '2020-12-31'
select sum(`amount`) as aggregate from `payrolls` where date(`created_at`) >= '2020-12-01' and date(`created_at`) <= '2020-12-31'

                $purchase_amount = Purchase::whereDate('created_at', '>=' , $start_date)->whereDate('created_at', '<=' , $end_date)->where('user_id', Auth::id())->sum('grand_total');
            }
            else{
                $sale_amount = Sale::whereDate('created_at', '>=' , $start_date)->whereDate('created_at', '<=' , $end_date)->sum('grand_total');
                $purchase_amount = Purchase::whereDate('created_at', '>=' , $start_date)->whereDate('created_at', '<=' , $end_date)->sum('grand_total');
---
select sum(`grand_total`) as aggregate from `sales` where date(`created_at`) >= '2021-01-01' and date(`created_at`) <= '2021-01-31'
select sum(`grand_total`) as aggregate from `purchases` where date(`created_at`) >= '2021-01-01' and date(`created_at`) <= '2021-01-31'

        }


    $count_customers = Customer::query()
        ->count();

    $count_sales = Sale::query()
    ->count();

    $count_purchases = Purchase::query()
    ->count();

    $count_products = Product::query()
    ->count();

        $role = Role::find(Auth::user()->role_id);
        $permissions = Role::findByName($role->name)->permissions;
---
select count(*) as aggregate from `customers`
select count(*) as aggregate from `sales`
select count(*) as aggregate from `purchases`
select count(*) as aggregate from `products`
select `permissions`.*, `role_has_permissions`.`role_id` as `pivot_role_id`, `role_has_permissions`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_has_permissions` on `permissions`.`id` = `role_has_permissions`.`permission_id` where `role_has_permissions`.`role_id` = 1